import re
MORSE = {'a': '.-',    'b': '-...',  'c': '-.-.',
         'd': '-..',   'e': '.',     'f': '..-.',
         'g': '--.',   'h': '....',  'i': '..',
         'j': '.---',  'k': '-.-',   'l': '.-..',
         'm': '--',    'n': '-.',    'o': '---',
         'p': '.--.',  'q': '--.-',  'r': '.-.',
         's': '...',   't': '-',     'u': '..-',
         'v': '...-',  'w': '.--',   'x': '-..-',
         'y': '-.--',  'z': '--..',  '0': '-----',
         '1': '.----', '2': '..---', '3': '...--',
         '4': '....-', '5': '.....', '6': '-....',
         '7': '--...', '8': '---..', '9': '----.'
        }

def morse_encoder(text):
    l = []
    for i in text.lower():
        if i == " ":
            l.append('   ')
        else:
            for f,g in MORSE.items():
                if i == f:
                    print(g)
                    l.append(g + " ")
    print(((','.join(l)).replace(',', '')))
    result = (','.join(l)).replace(',', '')
    result_complete = re.sub(r'    ', '   ', result)
    print(result_complete[0:-1])
    return result_complete[0:-1]


if __name__ == '__main__':
    assert morse_encoder("some text") == "... --- -- .   - . -..- -"
    assert morse_encoder("2018") == "..--- ----- .---- ---.."
    assert morse_encoder("It was a good day") == ".. -   .-- .- ...   .-   --. --- --- -..   -.. .- -.--"

"""
Ваша задача - зашифровать текстовое сообщение используя азбуку Морзе. Исходный текст будет состоять только из букв (в верхнем и нижнем регистре), чисел и пробелов. Специальные символы использоваться не будут ('&', '?', '#' и т.п.)
Используйте 1 пробел между буквами одого слова и 3 пробела между отдельными словами.

Входные данные: Секретное сообщение как строка
Выходные данные: Зашифрованный текст

Примеры:
morse_encoder("some text") == "... --- -- .   - . -..- -"
morse_encoder("2018") == "..--- ----- .---- ---.."
morse_encoder("It was a good day") == ".. -   .-- .- ...   .-   --. --- --- -..   -.. .- -.--"

Как это используется: Для криптографии, передачи и защиты важной информации.

Предусловия:
0 < len(text) < 50
Текст будет содержать только буквы английского алфавита (в верхнем и нижнем регистре), числа и пробелы.
"""
